# Lesson 31.DataFrame数据结构基础

&emsp;&emsp;如果将 Series 类比为带灵活索引的一维数组，那么 DataFrame 就可以看作是一种既有灵活的行索引，又有灵活列名的二维数组。就像你可以把二维数组看成是有序排列的一维数组一样，你也可以把 DataFrame 看成是有序排列的若干 Series 对象。这里的“排列”指的是它们拥有共同的索引。

In [1]:
import numpy as np
import pandas as pd

### 1.DataFrame的创建

#### 1.1 由Series创建DataFrame

首先，我们可以将DataFrame看成是多个Series的组合，看成是二维Series。

In [2]:
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([2, 3, 4], index=['b', 'c', 'd'])

In [3]:
s1

a    1
b    2
c    3
dtype: int64

In [4]:
s2

b    2
c    3
d    4
dtype: int64

使用pd.DataFrame函数创建DataFrame

In [7]:
df = pd.DataFrame([s1, s2])
df

     a    b    c    d
0  1.0  2.0  3.0  NaN
1  NaN  2.0  3.0  4.0

不难发现，组合的过程会将Series视为一行行数据，依次写入DataFrame表格中，并且列的排布会按照Series的Index来进行。

#### 1.2 查看DataFrame函数

DataFrame创建函数格式如下：      
> df = pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

其中，data部分可以输入一维或二维结构数据，index代表行标，columns代表列标。并且和NumPy中array一样，也可以设置dtype属性。

当然，除了利用Series生成DataFrame以外，我们还可以使用二维array创建DataFrame。

In [12]:
l = [[1, 2, 3], [2, 3, 4]]
l

[[1, 2, 3], [2, 3, 4]]

In [13]:
a = np.array(l)
a

array([[1, 2, 3],
       [2, 3, 4]])

In [14]:
pd.DataFrame(a)

   0  1  2
0  1  2  3
1  2  3  4

In [15]:
pd.DataFrame(l)

   0  1  2
0  1  2  3
1  2  3  4

可以发现，DataFrame和array可以说是并行的数据结构。

#### 1.3 利用字典创建DataFrame

In [18]:
d1 = {'a':range(3),'b':range(3),'c':range(3)}
d1

{'a': range(0, 3), 'b': range(0, 3), 'c': range(0, 3)}

In [20]:
pd.DataFrame(d1)

   a  b  c
0  0  0  0
1  1  1  1
2  2  2  2

在创建过程中，字典的Key会编程column名称，并且系统会自动生成index

### 2.DataFrame中的index和columns

&emsp;&emsp;根据DataFrame的创建函数我们知道，DataFrame中index代表行标，column代表列标。并且，根据上述创建过程，我们不难发现，当使用字典或者Series创建DataFrame时，字典的Key和Series的Index会变成列标，并会自动生成DataFrame的行标。当然，我们还可以在DataFrame创建过程修改行、列标。

In [22]:
a

array([[1, 2, 3],
       [2, 3, 4]])

In [24]:
pd.DataFrame(a, index=[1, 2], columns=['a', 'b', 'c'])

   a  b  c
1  1  2  3
2  2  3  4

但对于本已拥有列表的对象，则不能在创建的时候临时修改。

In [25]:
s1

a    1
b    2
c    3
dtype: int64

In [26]:
s2

b    2
c    3
d    4
dtype: int64

In [27]:
pd.DataFrame([s1, s2], index = range(2), columns=range(3))

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN

实际上，在创建df的过程中，对于已有列标的对象，column参数实际上相当于是找出对应的列并组成df。

In [28]:
pd.DataFrame([s1, s2], index = range(2), columns=['a', 'b'])

     a    b
0  1.0  2.0
1  NaN  2.0

但行标不是，行标如果位数不匹配，则会报错。

In [29]:
pd.DataFrame([s1, s2], index = 1, columns=['a', 'b'])

TypeError: Index(...) must be called with a collection of some kind, 1 was passed

查看index和columns属性

In [32]:
df = pd.DataFrame([s1, s2])
df

     a    b    c    d
0  1.0  2.0  3.0  NaN
1  NaN  2.0  3.0  4.0

In [35]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=2, step=1)

当然，根据上述的操作不难发现，我们可以在创建df的过程中，根据输入的data参数来调整输入的行，根据输入的columns参数来调整表格的列。据此灵活的创建df。

In [39]:
df['a']

0    1.0
1    NaN
Name: a, dtype: float64

### 3 DataFrame的列操作
对于一个表结构数据来说，列的操作是最常用的操作之一。而由于DataFrame具备字典属性，因此列的选取，设置和删除列的工作原理与类似的 dict 操作相同。

In [41]:
d = {'one' : [1., 2., 3., 4.],
     'two' : [4., 3., 2., 1.]}

In [42]:
df = pd.DataFrame(d)
df

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

单独提取某一列

In [17]:
df['one'] #单独某一列的提取，得到的Series数据类型

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

列与列的计算

In [18]:
df['one'] * df['two']

a    1.0
b    4.0
c    9.0
d    NaN
dtype: float64

新增一列

In [19]:
df['three'] = df['one'] * df['two']
df

   one  two  three
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

列的逻辑判别结果

In [20]:
df['one'] > 2

a    False
b    False
c     True
d    False
Name: one, dtype: bool

In [21]:
df['flag'] = df['one'] > 2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

列也可以进行数据科学运算

In [22]:
df['result'] = np.exp(df['two'])

In [23]:
df

   one  two  three   flag     result
a  1.0  1.0    1.0  False   2.718282
b  2.0  2.0    4.0  False   7.389056
c  3.0  3.0    9.0   True  20.085537
d  NaN  4.0    NaN  False  54.598150

DataFram 的列可以像使用 dict 一样被删除或移出：

In [24]:
del df['two']

In [25]:
df

   one  three   flag     result
a  1.0    1.0  False   2.718282
b  2.0    4.0  False   7.389056
c  3.0    9.0   True  20.085537
d  NaN    NaN  False  54.598150

In [26]:
df.pop('three') #删除原数据集中的three这一列，并且返回three这一列的值

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [27]:
df

   one   flag     result
a  1.0  False   2.718282
b  2.0  False   7.389056
c  3.0   True  20.085537
d  NaN  False  54.598150

当赋予的值为标量时，会自动在列里广播填充：

In [28]:
df['foo'] = 'bar'
df

   one   flag     result  foo
a  1.0  False   2.718282  bar
b  2.0  False   7.389056  bar
c  3.0   True  20.085537  bar
d  NaN  False  54.598150  bar

如果传入的是 Series 并且索引不完全相同，那么会默认按照索引对齐：

In [29]:
df['one'][1:3]

b    2.0
c    3.0
Name: one, dtype: float64

In [30]:
df['one_trunc'] = df['one'][1:3]
df

   one   flag     result  foo  one_trunc
a  1.0  False   2.718282  bar        NaN
b  2.0  False   7.389056  bar        2.0
c  3.0   True  20.085537  bar        3.0
d  NaN  False  54.598150  bar        NaN

利用insert函数插入列  
默认情况下，直接的赋值操作列插入到最后的位置。insert() 方法可用于插入列中的特定位置：

In [31]:
df.insert(1, 'two', np.exp(df['one']))
df

   one        two   flag     result  foo  one_trunc
a  1.0   2.718282  False   2.718282  bar        NaN
b  2.0   7.389056  False   7.389056  bar        2.0
c  3.0  20.085537   True  20.085537  bar        3.0
d  NaN        NaN  False  54.598150  bar        NaN

使用assin方法对列进行重新分配

In [43]:
df_sample = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})
df_sample

    A         B
0   1 -0.948004
1   2  1.861113
2   3 -1.417652
3   4 -1.847085
4   5 -0.723821
5   6  0.182721
6   7  0.973281
7   8  0.965252
8   9  0.547538
9  10 -1.083923

In [44]:
c1 = np.log(df_sample['A'])
c1

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
5    1.791759
6    1.945910
7    2.079442
8    2.197225
9    2.302585
Name: A, dtype: float64

In [45]:
c2 = np.abs(df_sample['B'])
c2

0    0.948004
1    1.861113
2    1.417652
3    1.847085
4    0.723821
5    0.182721
6    0.973281
7    0.965252
8    0.547538
9    1.083923
Name: B, dtype: float64

In [48]:
df_sample.assign(A=c1,abs_b=c2)  # 覆盖A列，新生成abs_b列。

          A         B     abs_b
0  0.000000 -0.948004  0.948004
1  0.693147  1.861113  1.861113
2  1.098612 -1.417652  1.417652
3  1.386294 -1.847085  1.847085
4  1.609438 -0.723821  0.723821
5  1.791759  0.182721  0.182721
6  1.945910  0.973281  0.973281
7  2.079442  0.965252  0.965252
8  2.197225  0.547538  0.547538
9  2.302585 -1.083923  1.083923

### 4.数据的读取与写入

#### 4.1 csv格式文件读取

&emsp;&emsp;csv格式文件也就是用逗号分隔的文本文件，也是比较通用的数据本地存储格式。在pandas中，可使用pd.read_csv来进行读取。      
首先，我们将需要读取的数据文件iris.csv放在当前操作目录下，然后进行读取。

In [64]:
df = pd.read_csv("iris.csv")

In [65]:
df

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [66]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [54]:
pd.read_csv("file1.csv")

,0.1519297962345345,0.6505118342785916,0.4414451634170802,0.5653473424659354,0.46306260786208986
0,0.073225,0.053739,0.519359,0.713302,0.102810
1,0.033007,0.998910,0.344081,0.568729,0.527378
2,0.249928,0.586669,0.210365,0.564779,0.637262
3,0.549999,0.978295,0.168403,0.792304,0.198759
4,0.959982,0.572779,0.610644,0.341065,0.544200
5,0.767881,0.291999,0.809437,0.808167,0.034668
6,0.426841,0.832254,0.704015,0.988063,0.980993
7,0.344947,0.170004,0.350522,0.481115,0.226801
8,0.302636,0.690355,0.167111,0.513492,0.325921

In [57]:
df1 = pd.read_csv("file1.csv", header = None)
df1

          0         1         2         3         4
0  0.151930  0.650512  0.441445  0.565347  0.463063
1  0.073225  0.053739  0.519359  0.713302  0.102810
2  0.033007  0.998910  0.344081  0.568729  0.527378
3  0.249928  0.586669  0.210365  0.564779  0.637262
4  0.549999  0.978295  0.168403  0.792304  0.198759
5  0.959982  0.572779  0.610644  0.341065  0.544200
6  0.767881  0.291999  0.809437  0.808167  0.034668
7  0.426841  0.832254  0.704015  0.988063  0.980993
8  0.344947  0.170004  0.350522  0.481115  0.226801
9  0.302636  0.690355  0.167111  0.513492  0.325921

In [58]:
df1.columns = ['a', 'b', 'c', 'd', 'e']

In [59]:
df1

          a         b         c         d         e
0  0.151930  0.650512  0.441445  0.565347  0.463063
1  0.073225  0.053739  0.519359  0.713302  0.102810
2  0.033007  0.998910  0.344081  0.568729  0.527378
3  0.249928  0.586669  0.210365  0.564779  0.637262
4  0.549999  0.978295  0.168403  0.792304  0.198759
5  0.959982  0.572779  0.610644  0.341065  0.544200
6  0.767881  0.291999  0.809437  0.808167  0.034668
7  0.426841  0.832254  0.704015  0.988063  0.980993
8  0.344947  0.170004  0.350522  0.481115  0.226801
9  0.302636  0.690355  0.167111  0.513492  0.325921

#### 4.2 Excel文件读取

另外，我们还可以使用read_excel函数读取excel文件。

In [68]:
df2 = pd.read_excel('test.xlsx',sheet_name='nam') # 利用sheet_name参数指定读取表格
df2.head()

   Rank       City            State  Population Date of census/estimate
0     1  London[2]   United Kingdom     8615246              2014-06-01
1     2     Berlin          Germany     3437916              2014-05-31
2     3     Madrid            Spain     3165235              2014-01-01
3     4       Rome            Italy     2872086              2014-09-30
4     5      Paris           France     2273305              2013-01-01

#### 4.3 数据输出

In [69]:
df_sample = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})
df_sample

    A         B
0   1  0.271052
1   2  0.233439
2   3 -0.976472
3   4  0.590058
4   5 -0.063329
5   6 -0.354133
6   7 -0.173483
7   8  0.171688
8   9  0.713104
9  10  1.268019

In [70]:
df_sample.to_csv('sample.csv')

In [71]:
pd.read_csv('sample.csv')

   Unnamed: 0   A         B
0           0   1  0.271052
1           1   2  0.233439
2           2   3 -0.976472
3           3   4  0.590058
4           4   5 -0.063329
5           5   6 -0.354133
6           6   7 -0.173483
7           7   8  0.171688
8           8   9  0.713104
9           9  10  1.268019

In [72]:
df_sample.to_csv('sample.csv', index=False)

In [73]:
pd.read_csv('sample.csv')

    A         B
0   1  0.271052
1   2  0.233439
2   3 -0.976472
3   4  0.590058
4   5 -0.063329
5   6 -0.354133
6   7 -0.173483
7   8  0.171688
8   9  0.713104
9  10  1.268019

In [78]:
df_sample.to_excel('sample.xlsx', index=False)

In [79]:
pd.read_excel('sample.xlsx')

    A         B
0   1  0.271052
1   2  0.233439
2   3 -0.976472
3   4  0.590058
4   5 -0.063329
5   6 -0.354133
6   7 -0.173483
7   8  0.171688
8   9  0.713104
9  10  1.268019